This is used to post warning. "Bar Engagement 2" has an incorrect value.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId SecondaryEngagementParameterWarning { get; }
  Visual Basic
Public Shared ReadOnly Property SecondaryEngagementParameterWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SecondaryEngagementParameterWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace